In [3]:
file = open('data.csv','x')
file.close()

In [4]:
import pandas as pd
df = pd.read_csv('data.csv')
df

   sn   name  age        add
0   1    Ram   78  Kathmandu
1   2  Shyam   67  Bhaktapur
2   3   Hari   90   Lalitpur
3   4  Nabin   45    Chitwan
4   5   Sita   67  Kathmandu
5   6  Sabin   45      Jhapa

In [8]:
df.head()

   sn   name  age        add
0   1    Ram   78  Kathmandu
1   2  Shyam   67  Bhaktapur
2   3   Hari   90   Lalitpur
3   4  Nabin   45    Chitwan
4   5   Sita   67  Kathmandu

In [10]:
df.tail()

   sn   name  age        add
1   2  Shyam   67  Bhaktapur
2   3   Hari   90   Lalitpur
3   4  Nabin   45    Chitwan
4   5   Sita   67  Kathmandu
5   6  Sabin   45      Jhapa

In [13]:
import pandas as pd
df = pd.read_csv('data.csv')
df

     name  age        add
sn
1     Ram   78  Kathmandu
2   Shyam   67  Bhaktapur
3    Hari   90   Lalitpur
4   Nabin   45    Chitwan
5    Sita   67  Kathmandu
6   Sabin   45      Jhapa

In [15]:
import pandas as pd
df = pd.read_csv('data.csv',usecols = ['sn','name','age'],index_col = 'sn')
df

     name  age
sn
1     Ram   78
2   Shyam   67
3    Hari   90
4   Nabin   45
5    Sita   67
6   Sabin   45

In [16]:
df.iloc[2:5]

     name  age
sn
3    Hari   90
4   Nabin   45
5    Sita   67

In [21]:
df.values

array([['Ram', 78],
       ['Shyam', 67],
       ['Hari', 90],
       ['Nabin', 45],
       ['Sita', 67],
       ['Sabin', 45]], dtype=object)

In [23]:
list(df['name'])

['Ram', 'Shyam', 'Hari', 'Nabin', 'Sita', 'Sabin']

In [26]:
df.loc[2:5]

     name  age
sn
2   Shyam   67
3    Hari   90
4   Nabin   45
5    Sita   67

In [32]:
# filter
import pandas as pd
df = pd.read_csv('data.csv',index_col = 'sn')
df['name']

sn
1      Ram
2    Shyam
3     Hari
4    Nabin
5     Sita
6    Sabin
Name: name, dtype: object

In [34]:
df[df['name'] == 'Ram']

   name  age        add
sn
1   Ram   78  Kathmandu

In [35]:
df[df['add'] == 'Kathmandu']

    name  age        add
sn
1    Ram   78  Kathmandu
5   Sita   67  Kathmandu

In [37]:
df[(df['add'] == 'Kathmandu') & (df['age'] > 70)]

   name  age        add
sn
1   Ram   78  Kathmandu

In [41]:
# dict to dataframe
data = {'name':['Ram','Shyam','Hari'],
       'age':[89,67,67],
       'add':['Kathmandu','Bhaktapur','Lalitpur']}

df = pd.DataFrame(data)
df.to_csv('new_data.csv')

In [43]:
import csv
l = []
with open('new_data.csv') as csvfile:
    reader = csv.DictReader(csvfile)
    for row in reader:
        l.append(row)
l

[{'': '0', 'name': 'Ram', 'age': '89', 'add': 'Kathmandu'},
 {'': '1', 'name': 'Shyam', 'age': '67', 'add': 'Bhaktapur'},
 {'': '2', 'name': 'Hari', 'age': '67', 'add': 'Lalitpur'}]

In [45]:
import csv
csv_columns = ['Name', 'Age', 'Address']
dict = [
    {'Name':'Aayush','Age':23,'Address':'Katmandu'},
    {'Name':'Shyam','Age':33,'Address':'Patan'}
]

with open("data.csv", 'w') as csvfile:
    writer = csv.DictWriter(csvfile, fieldnames=csv_columns)
    writer.writeheader()
    
    for data in dict:
        writer.writerow(data)

In [50]:
import pandas as pd
df = pd.read_csv('data.csv')
df['Name'][0] = 'Akash'
df

C:\Users\Aayush\AppData\Local\Temp\ipykernel_4932\2882103287.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Name'][0] = 'Akash'

    Name  Age   Address
0  Akash   23  Katmandu
1  Shyam   33     Patan

In [51]:
df.to_csv('data.csv')

In [57]:
import pandas as pd
df = pd.read_csv('data.csv')

df = df.drop('Name',axis = 1)
df

   Unnamed: 0  Age   Address
0           0   23  Katmandu
1           1   33     Patan

In [58]:
import pandas as pd
df = pd.read_csv('data.csv')
df = df.drop(['Name','Age'],axis = 1)
df

   Unnamed: 0   Address
0           0  Katmandu
1           1     Patan

In [60]:
import pandas as pd
df = pd.read_csv('data.csv',index_col = 'sn')
df

     Name  Age   Address
sn
0   Akash   23  Katmandu
1   Shyam   33     Patan

In [61]:
df = df.drop([0],axis = 0)
df

     Name  Age Address
sn
1   Shyam   33   Patan